[
  {
    "chunk_id": "0d0e5d7a",
    "text": "INTRODUCTION TO CYBER SECURITY\n(BETCK105/205 I)\nNOTES\nFor First/Second Semester B.E[VTU/CBCS, 2023-2024] Syllabus\nJ yothi R, Assistant Professor, Dept.of ISE Introduction to Cyber Security (BETCK105I/205I) 1\nSyllabus\nCourse Title: Introduction to Cyber Security Course Code: : BETCK105I/205\nTeaching\nMODULE-I\nHours\nIntroduction to Cybercrime: Cybercrime: Definition and Origins of the Word, Cybercrime and\nInformation Security, Who are Cybercriminals? Classifications of Cybercrimes, An Indian\n8\nPerspective, Hacking and Indian Laws., Global PerspectivesTextbook:1 Chapter 1 (1.1 to 1.5,\n1.7-1.9)\nBlooms Taxonomy: L1 – Remembering, L2 – Understanding\nTeaching\nMODULE-II\nHours\nCyber Offenses: How Criminals Plan Them: Introduction, How criminals plan the attacks,\nSocial Engineering, Cyber Stalking, Cybercafe & cybercrimes. Botnets: The fuel for cybercrime, 8\nAttack Vector. Textbook:1 Chapter 2 (2.1 to 2.7)\nBlooms Taxonomy: L1 – Remembering, L2 – Understanding\nTeaching\nMODULE-III\nHours\nTools and Methods used in Cybercrime: Introduction, Proxy Servers, Anonymizers, Phishing,\nPassword Cracking, Key Loggers and Spyways, Virus and Worms, Trozen Horses and\nBackdoors, Steganography, DoS and DDOS Attackes, Attacks on Wireless networks.\n8\nTextbook:1 Chapter 4 (4.1 to 4.9, 4.12)\nBlooms Taxonomy: L1 – Remembering, L2 – Understanding\nMODULE-IV Teaching\nHours\nPhishing and Identity Theft: Introduction, methods of phishing, phishing, phising techniques,\nspear phishing, types of phishing scams, phishing toolkits and spy phishing, counter measures,\n8\nIdentity Theft Textbook:1 Chapter 5 (5.1. to 5.3)\nBlooms Taxonomy: L1 – Remembering , L2 – Understanding\nMODULE-V\nTeaching\nHours\nUnderstanding Computer Forensics: Introdcution, Historical Background of Cyberforensics,\nDigital Foresics Science, Need for Computer Foresics, Cyber Forensics and Digital Evidence,\nDigital Forensic Life cycle, Chain of Custody Concepts, network forensics. Textbook:1 Chapter\n8\n7 (7.1. to 7.5, 7.7 to 7.9)\nBlooms Taxonomy: L1 – Remembering, L2 – Understanding\nSL Name Of the Name Of the Edition and\nTitle Of The Book ISBN\nNo Author/s Publisher Year\n, “Cyber Security: Understanding Sunit Belapure First Edition\nWiley India Pvt\n1 Cyber Crimes, Computer Forensics and Nina (Reprinted 978-81- 265-21791, 2011,\nLtd\nAnd Legal Perspectives” Godbole 2018)\nJ yothi R, Assistant Professor, Dept.of ISE Introduction to Cyber Security (BETCK105I/205I) 2",
    "page_number": 1,
    "start_char": 0,
    "end_char": 2419,
    "word_count": 335,
    "metadata": {
      "original_pages": [
        1,
        2
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_3"
  },
  {
    "chunk_id": "8faf83b7",
    "text": "ISE Introduction to Cyber Security (BETCK105I/205I) 1 Syllabus Course Title: Introduction to Cyber Security Course Code: : BETCK105I/205 Teaching MODULE-I Hours Introduction to Cybercrime: Cybercrime: Definition and Origins of the Word, Cybercrime and Information Security, Who are Cybercriminals? Classifications of Cybercrimes, An Indian 8 Perspective, Hacking and Indian Laws., Global PerspectivesTextbook:1 Chapter 1 (1.1 to 1.5, 1.7-1.9) Blooms Taxonomy: L1 – Remembering, L2 – Understanding Teaching MODULE-II Hours Cyber Offenses: How Criminals Plan Them: Introduction, How criminals plan the attacks, Social Engineering, Cyber Stalking, Cybercafe & cybercrimes. Botnets: The fuel for cybercrime, 8 Attack Vector. Textbook:1 Chapter 2 (2.1 to 2.7) Blooms Taxonomy: L1 – Remembering, L2 – Understanding Teaching MODULE-III Hours Tools and Methods used in Cybercrime: Introduction, Proxy Servers, Anonymizers, Phishing, Password Cracking, Key Loggers and Spyways, Virus and Worms, Trozen Horses and Backdoors, Steganography, DoS and DDOS Attackes, Attacks on Wireless networks. 8 Textbook:1 Chapter 4 (4.1 to 4.9, 4.12) Blooms Taxonomy: L1 – Remembering, L2 – Understanding MODULE-IV Teaching Hours Phishing and Identity Theft: Introduction, methods of phishing, phishing, phising techniques, spear phishing, types of phishing scams, phishing toolkits and spy phishing, counter measures, 8 Identity Theft Textbook:1 Chapter 5 (5.1. to 5.3) Blooms Taxonomy: L1 – Remembering , L2 – Understanding MODULE-V Teaching Hours Understanding Computer Forensics: Introdcution, Historical Background of Cyberforensics, Digital Foresics Science, Need for Computer Foresics, Cyber Forensics and Digital Evidence, Digital Forensic Life cycle, Chain of Custody Concepts, network forensics. Textbook:1 Chapter 8 7 (7.1. to 7.5, 7.7 to 7.9) Blooms Taxonomy: L1 – Remembering, L2 – Understanding SL Name Of the Name Of the Edition and Title Of The Book ISBN No Author/s Publisher Year , “Cyber Security: Understanding Sunit Belapure First Edition Wiley India Pvt 1 Cyber Crimes, Computer Forensics and Nina (Reprinted 978-81- 265-21791, 2011, Ltd And Legal Perspectives” Godbole 2018) J yothi R, Assistant Professor, Dept.of ISE Introduction to Cyber Security (BETCK105I/205I) 2 MODULE 1. INTRODUCTION TO CYBERCRIME List of Topics:  Introduction  Cybercrime: Definition and Origins of the Word  Cybercrime and Information Security  Who are Cybercriminals?  Classifications of Cybercrimes  Cybercrime: The Legal Perspectives  Cybercrimes: An Indian Perspective  Cybercrime and the Indian ITA 2000  A Global Perspective on Cybercrimes  Cybercrime Era: Survival Mantra for the Netizens INTRODUCTION",
    "page_number": 2,
    "start_char": 0,
    "end_char": 2692,
    "word_count": 379,
    "metadata": {
      "original_page": 2,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 1,
      "next_page": 3,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_1",
    "next_page_ref": "page_3"
  },
  {
    "chunk_id": "7ab84a9d",
    "text": "Cyber Forensics and Digital Evidence, Digital Forensic Life cycle, Chain of Custody Concepts, network forensics. Textbook:1 Chapter 8 7 (7.1. to 7.5, 7.7 to 7.9) Blooms Taxonomy: L1 – Remembering, L2 – Understanding SL Name Of the Name Of the Edition and Title Of The Book ISBN No Author/s Publisher Year , “Cyber Security: Understanding Sunit Belapure First Edition Wiley India Pvt 1 Cyber Crimes, Computer Forensics and Nina (Reprinted 978-81- 265-21791, 2011, Ltd And Legal Perspectives” Godbole 2018) J yothi R, Assistant Professor, Dept.of ISE Introduction to Cyber Security (BETCK105I/205I) 2 MODULE 1. INTRODUCTION TO CYBERCRIME List of Topics:  Introduction  Cybercrime: Definition and Origins of the Word  Cybercrime and Information Security  Who are Cybercriminals?  Classifications of Cybercrimes  Cybercrime: The Legal Perspectives  Cybercrimes: An Indian Perspective  Cybercrime and the Indian ITA 2000  A Global Perspective on Cybercrimes  Cybercrime Era: Survival Mantra for the Netizens INTRODUCTION  “Cyber security is the protection of internet-connected systems, including hardware, software and data, from cyber attacks”.  “Cybersecurity” means protecting information, equipment, devices, computer, computer resource, communication device and information stored therein from unauthorized access, use, disclosure, disruption, modification or destruction.  Almost everyone is aware of the rapid growth of the Internet.  Given the unrestricted number of free websites, the Internet has undeniably opened a new way of exploitation known as cybercrime.  These activities involve the use of computers, the Internet, cyberspace and the worldwide web (WWW).  Interestingly, cybercrime is not a new phenomena; the first recorded cybercrime took place in the year 1820.  It is one of the most talked about topics in the recent years.  Based on a 2008 survey in Australia, the below shows the cybercrime trend J yothi R, Assistant Professor, Dept.of ISE Introduction to Cyber Security (BETCK105I/205I) 3",
    "page_number": 3,
    "start_char": 0,
    "end_char": 2030,
    "word_count": 305,
    "metadata": {
      "original_page": 3,
      "has_prev_overlap": true,
      "has_next_overlap": false,
      "prev_page": 2,
      "next_page": null,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_2",
    "next_page_ref": ""
  }
]