[
  {
    "chunk_id": "07e97051",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nCYBERSECURITY BASICS\nCyber criminals target Knowing some cybersecurity basics and\nputting them in practice will help you\ncompanies of all sizes. protect your business and reduce the risk\nof a cyber attack.\nPROTECT\nYOUR FILES & DEVICES\nUpdate your software Secure your files Require passwords\nThis includes your apps, web Back up important files offline, Use passwords for all laptops,\nbrowsers, and operating on an external hard drive, or in tablets, and smartphones.\nsystems. Set updates to the cloud. Make sure you store Don’t leave these devices\nhappen automatically. your paper files securely, too. unattended in public places.\nEncrypt devices Use multi-factor authentication\nEncrypt devices and other media that Require multi-factor authentication to access areas\ncontain sensitive personal information. of your network with sensitive information. This\nThis includes laptops, tablets, requires additional steps beyond logging in with a\nsmartphones, removable drives, backup password — like a temporary code on a smartphone\ntapes, and cloud storage solutions. or a key that’s inserted into a computer.\nLLEEAARRNN MMOORREE AATT::\nFFTTCC..ggoovv//SSmmaallllBBuussiinneessss\nCYBERSECURITY FOR\nSMALL BUSINESS\nPROTECT\nYOUR WIRELESS NETWORK\nSecure your router\nChange the default name and password, turn off remote management,\nand log out as the administrator once the router is set up.\nUse at least WPA2 encryption\nMake sure your router offers WPA2 or WPA3 encryption, and that it’s\nturned on. Encryption protects information sent over your network so it\ncan’t be read by outsiders.\nMAKE\nSMART SECURITY\nYOUR BUSINESS AS USUAL\nRequire strong passwords Train all staff Have a plan\nA strong password is at least Create a culture of security Have a plan for saving data,\n12 characters that are a mix of by implementing a regular running the business, and\nnumbers, symbols, and capital schedule of employee training. notifying customers if you\nlowercase letters. Update employees as you experience a breach. The FTC’s\nfind out about new risks and Data Breach Response: A Guide\nNever reuse passwords and\nvulnerabilities. If employees for Business gives steps you\ndon’t share them on the phone,\ndon’t attend, consider blocking can take. You can find it at\nin texts, or by email.\ntheir access to the network. FTC.gov/DataBreach.\nLimit the number of\nunsuccessful log-in attempts to\nlimit password-guessing attacks.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 1,
    "start_char": 0,
    "end_char": 2473,
    "word_count": 375,
    "metadata": {
      "original_pages": [
        1,
        2
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_3"
  },
  {
    "chunk_id": "a9a8b8e8",
    "text": "personal information. of your network with sensitive information. This This includes laptops, tablets, requires additional steps beyond logging in with a smartphones, removable drives, backup password — like a temporary code on a smartphone tapes, and cloud storage solutions. or a key that’s inserted into a computer. LLEEAARRNN MMOORREE AATT:: FFTTCC..ggoovv//SSmmaallllBBuussiinneessss CYBERSECURITY FOR SMALL BUSINESS PROTECT YOUR WIRELESS NETWORK Secure your router Change the default name and password, turn off remote management, and log out as the administrator once the router is set up. Use at least WPA2 encryption Make sure your router offers WPA2 or WPA3 encryption, and that it’s turned on. Encryption protects information sent over your network so it can’t be read by outsiders. MAKE SMART SECURITY YOUR BUSINESS AS USUAL Require strong passwords Train all staff Have a plan A strong password is at least Create a culture of security Have a plan for saving data, 12 characters that are a mix of by implementing a regular running the business, and numbers, symbols, and capital schedule of employee training. notifying customers if you lowercase letters. Update employees as you experience a breach. The FTC’s find out about new risks and Data Breach Response: A Guide Never reuse passwords and vulnerabilities. If employees for Business gives steps you don’t share them on the phone, don’t attend, consider blocking can take. You can find it at in texts, or by email. their access to the network. FTC.gov/DataBreach. Limit the number of unsuccessful log-in attempts to limit password-guessing attacks. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS Understanding THE NIST CYBERSECURITY FRAMEWORK You may have heard about the businesses of all sizes better understand, manage, and reduce their cybersecurity risk NIST Cybersecurity Framework, and protect their networks and data. The Framework is voluntary. It gives your business but what exactly is it? an outline of best practices to help you decide where to focus your time and money for And does it apply to you? cybersecurity protection. NIST is the National Institute of",
    "page_number": 2,
    "start_char": 0,
    "end_char": 2164,
    "word_count": 334,
    "metadata": {
      "original_page": 2,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 1,
      "next_page": 3,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_1",
    "next_page_ref": "page_3"
  },
  {
    "chunk_id": "9127b720",
    "text": "Data Breach Response: A Guide Never reuse passwords and vulnerabilities. If employees for Business gives steps you don’t share them on the phone, don’t attend, consider blocking can take. You can find it at in texts, or by email. their access to the network. FTC.gov/DataBreach. Limit the number of unsuccessful log-in attempts to limit password-guessing attacks. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS Understanding THE NIST CYBERSECURITY FRAMEWORK You may have heard about the businesses of all sizes better understand, manage, and reduce their cybersecurity risk NIST Cybersecurity Framework, and protect their networks and data. The Framework is voluntary. It gives your business but what exactly is it? an outline of best practices to help you decide where to focus your time and money for And does it apply to you? cybersecurity protection. NIST is the National Institute of Standards and You can put the NIST Cybersecurity Framework Technology at the U. S. Department of Commerce. to work in your business in these five areas: The NIST Cybersecurity Framework helps Identify, Protect, Detect, Respond, and Recover. 1. IDENTIFY 2. PROTECT Make a list of all equipment, software, and data • Control who logs on to your network and uses you use, including laptops, smartphones, tablets, your computers and other devices. and point-of-sale devices. • Use security software to protect data. Create and share a company cybersecurity policy that covers: • Encrypt sensitive data, at rest and in transit. • Conduct regular backups of data. Roles and responsibilities • Update security software regularly, automating for employees, vendors, and those updates if possible. anyone else with access to sensitive data. • Have formal policies for safely disposing of electronic files and old devices. Steps to take to protect against • Train everyone who uses your computers, an attack and limit the damage if devices, and network about cybersecurity. one occurs. You can help employees understand their personal risk in addition to their crucial role in the workplace. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS 3. DETECT Monitor your computers Check your network Investigate any unusual for unauthorized personnel for unauthorized activities on your network access, devices (like USB users or connections. or by your staff. drives), and software. 4. RESPOND Have a plan for: • Notifying customers,",
    "page_number": 3,
    "start_char": 0,
    "end_char": 2450,
    "word_count": 377,
    "metadata": {
      "original_page": 3,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 2,
      "next_page": 4,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_2",
    "next_page_ref": "page_4"
  },
  {
    "chunk_id": "c32fe013",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\n3. DETECT\nMonitor your computers Check your network Investigate any unusual\nfor unauthorized personnel for unauthorized activities on your network\naccess, devices (like USB users or connections. or by your staff.\ndrives), and software.\n4. RESPOND\nHave a plan for:\n• Notifying customers, employees, and others • Investigating and containing an attack.\nwhose data may be at risk.\n• Updating your cybersecurity policy and\n• Keeping business operations up and running. plan with lessons learned.\n• Reporting the attack to law enforcement and • Preparing for inadvertent events\nother authorities. (like weather emergencies) that may\nput data at risk.\nTest your plan regularly.\n5. RECOVER\nAfter an attack:\nRepair and restore the Keep employees and customers\nequipment and parts of your informed of your response and\nnetwork that were affected. recovery activities.\nFor more information on the NIST Cybersecurity Framework and resources for small businesses,\ngo to NIST.gov/CyberFramework and NIST.gov/Programs-Projects/Small-Business-Corner-SBC.\nLEARN MORE AT:\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nPHYSICAL SECURITY\nCybersecurity begins with An employee accidentally leaves a flash drive\non a coffeehouse table. When he returns hours\nstrong physical security.\nlater to get it, the drive — with hundreds of Social\nSecurity numbers saved on it — is gone.\nLapses in physical security can expose Another employee throws stacks of old company\nsensitive company data to identity theft, bank records into a trash can, where a criminal\nwith potentially serious consequences. finds them after business hours.\nFor example:\nA burglar steals files and computers from your\noffice after entering through an unlocked window.\nPROTECT\nHOW TO EQUIPMENT & PAPER FILES\nHere are some tips for protecting information in paper files and on hard drives,\nflash drives, laptops, point-of-sale devices, and other equipment.\nStore securely Limit physical Send reminders Keep stock\naccess\nWhen paper files or Remind employees to Keep track of and\nelectronic devices When records or put paper files in locked secure any devices\ncontain sensitive devices contain file cabinets, log out that collect sensitive\ninformation, store sensitive data, of your network and customer information.\nthem in a locked allow access only to applications, and never Only keep files and\ncabinet or room. those who need it. leave files or devices data you need and\nwith sensitive data know who has access\nunattended. to them.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 4,
    "start_char": 0,
    "end_char": 2556,
    "word_count": 385,
    "metadata": {
      "original_pages": [
        4,
        5
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_6"
  },
  {
    "chunk_id": "c01c10a6",
    "text": "attack: Repair and restore the Keep employees and customers equipment and parts of your informed of your response and network that were affected. recovery activities. For more information on the NIST Cybersecurity Framework and resources for small businesses, go to NIST.gov/CyberFramework and NIST.gov/Programs-Projects/Small-Business-Corner-SBC. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PHYSICAL SECURITY Cybersecurity begins with An employee accidentally leaves a flash drive on a coffeehouse table. When he returns hours strong physical security. later to get it, the drive — with hundreds of Social Security numbers saved on it — is gone. Lapses in physical security can expose Another employee throws stacks of old company sensitive company data to identity theft, bank records into a trash can, where a criminal with potentially serious consequences. finds them after business hours. For example: A burglar steals files and computers from your office after entering through an unlocked window. PROTECT HOW TO EQUIPMENT & PAPER FILES Here are some tips for protecting information in paper files and on hard drives, flash drives, laptops, point-of-sale devices, and other equipment. Store securely Limit physical Send reminders Keep stock access When paper files or Remind employees to Keep track of and electronic devices When records or put paper files in locked secure any devices contain sensitive devices contain file cabinets, log out that collect sensitive information, store sensitive data, of your network and customer information. them in a locked allow access only to applications, and never Only keep files and cabinet or room. those who need it. leave files or devices data you need and with sensitive data know who has access unattended. to them. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO DATA ON YOUR DEVICES A burglary, lost laptop, stolen mobile phone, or misplaced flash drive — all can happen due to lapses in physical security. But they’re less likely to result in a data breach if information on those devices is protected. Here are a few ways to do that: Require complex passwords Require passwords that are long, complex, and unique. And make sure that these passwords are stored securely. Consider using a password manager. Use multi-factor authentication Require multi-factor authentication to access areas of",
    "page_number": 5,
    "start_char": 0,
    "end_char": 2411,
    "word_count": 366,
    "metadata": {
      "original_page": 5,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 4,
      "next_page": 6,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_4",
    "next_page_ref": "page_6"
  },
  {
    "chunk_id": "bd99a6ed",
    "text": "secure any devices contain sensitive devices contain file cabinets, log out that collect sensitive information, store sensitive data, of your network and customer information. them in a locked allow access only to applications, and never Only keep files and cabinet or room. those who need it. leave files or devices data you need and with sensitive data know who has access unattended. to them. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO DATA ON YOUR DEVICES A burglary, lost laptop, stolen mobile phone, or misplaced flash drive — all can happen due to lapses in physical security. But they’re less likely to result in a data breach if information on those devices is protected. Here are a few ways to do that: Require complex passwords Require passwords that are long, complex, and unique. And make sure that these passwords are stored securely. Consider using a password manager. Use multi-factor authentication Require multi-factor authentication to access areas of your network with sensitive information. This requires additional steps beyond logging in with a password — like a temporary code on a smartphone or a key that’s inserted into a computer. Limit login attempts Limit the number of incorrect login attempts allowed to unlock devices. This will help protect against intruders. Encrypt Encrypt portable media, including laptops and thumb drives, that contain sensitive information. Encrypt any sensitive data you send outside of the company, like to an accountant or a shipping service. TRAIN Include physical security in your regular employee trainings and communications. Remind employees to: YOUR Shred documents Promote security practices EMPLOYEES in all locations Always shred documents with sensitive information Maintain security practices even if working before throwing them away. remotely from home or on business travel. Erase data correctly Know the response plan Use software to erase data All staff should know what to do if before donating or discarding equipment or paper files are lost or old computers, mobile devices, stolen, including whom to notify and digital copiers, and drives. what to do next. Use Data Breach Don’t rely on “delete” alone. Response: A Guide for Business for help That does not actually remove creating a response plan. You can find it the file from the computer. at FTC.gov/DataBreach. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS RANSOMWARE Someone in your company The attackers ask for money or cryptocurrency, gets an email. but even if you pay, you don’t know if the cybercriminals will keep your data or destroy your files. Meanwhile, the information you It looks legitimate — but with one click on need to",
    "page_number": 6,
    "start_char": 0,
    "end_char": 2738,
    "word_count": 430,
    "metadata": {
      "original_page": 6,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 5,
      "next_page": 7,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_5",
    "next_page_ref": "page_7"
  },
  {
    "chunk_id": "5e772ab7",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nRANSOMWARE\nSomeone in your company\nThe attackers ask for money or cryptocurrency,\ngets an email. but even if you pay, you don’t know if the\ncybercriminals will keep your data or destroy\nyour files. Meanwhile, the information you\nIt looks legitimate — but with one click on need to run your business and sensitive\na link, or one download of an attachment, details about your customers, employees,\neveryone is locked out of your network. That and company are now in criminal hands.\nlink downloaded software that holds your data Ransomware can take a serious toll on your\nhostage. That’s a ransomware attack. business.\nHOW IT Criminals can start a ransomware\nHAPPENS attack in a variety of ways.\nScam emails Server\nvulnerabilities\nwith links and attachments that\nput your data and network at risk.\nwhich can be exploited\nThese phishing emails make up\nby hackers.\nmost ransomware attacks.\nInfected websites Online ads\nthat automatically download that contain malicious code\nmalicious software onto — even on websites you\nyour computer. know and trust.\nLEARN MORE AT:\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nPROTECT\nHOW TO YOUR BUSINESS\nHave a plan\nHow would your business stay up and running after a ransomware attack?\nPut this plan in writing and share it with everyone who needs to know.\nBack up your data\nRegularly save important files to a drive or server that’s not connected to your network.\nMake data backup part of your routine business operations.\nKeep your security up to date\nAlways install the latest patches and updates. Look for additional means of protection,\nlike email authentication, and intrusion prevention software, and set them to update\nautomatically on your computer. On mobile devices, you may have to do it manually.\nAlert your staff\nTeach them how to avoid phishing scams and show them some of the common ways\ncomputers and devices become infected. Include tips for spotting and protecting against\nransomware in your regular orientation and training.\nLimit the damage Keep your business running\nWHAT TO\nDO IF YOU’RE Immediately disconnect Now’s the time to implement that plan.\nthe infected computers or Having data backed up will help.\nATTACKED\ndevices from your network.\nShould I pay the ransom?\nIf your data has been stolen,\ntake steps to protect your\nLaw enforcement doesn’t recommend\ncompany and notify those\nthat, but it’s up to you to determine\nwho might be affected.\nwhether the risks and costs of paying\nare worth the possibility of getting\nContact the authorities\nyour files back. However, paying the\nReport the attack right away ransom may not guarantee you get\nto your local FBI office. your data back.\nNotify customers\nIf your data or personal information was compromised, make sure you\nnotify the affected parties ― they could be at risk of identity theft. Find\ninformation on how to do that at Data Breach Response: A Guide for\nBusiness. You can find it at FTC.gov/DataBreach.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 7,
    "start_char": 0,
    "end_char": 2999,
    "word_count": 491,
    "metadata": {
      "original_pages": [
        7,
        8
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_9"
  },
  {
    "chunk_id": "896fee60",
    "text": "links and attachments that put your data and network at risk. which can be exploited These phishing emails make up by hackers. most ransomware attacks. Infected websites Online ads that automatically download that contain malicious code malicious software onto — even on websites you your computer. know and trust. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO YOUR BUSINESS Have a plan How would your business stay up and running after a ransomware attack? Put this plan in writing and share it with everyone who needs to know. Back up your data Regularly save important files to a drive or server that’s not connected to your network. Make data backup part of your routine business operations. Keep your security up to date Always install the latest patches and updates. Look for additional means of protection, like email authentication, and intrusion prevention software, and set them to update automatically on your computer. On mobile devices, you may have to do it manually. Alert your staff Teach them how to avoid phishing scams and show them some of the common ways computers and devices become infected. Include tips for spotting and protecting against ransomware in your regular orientation and training. Limit the damage Keep your business running WHAT TO DO IF YOU’RE Immediately disconnect Now’s the time to implement that plan. the infected computers or Having data backed up will help. ATTACKED devices from your network. Should I pay the ransom? If your data has been stolen, take steps to protect your Law enforcement doesn’t recommend company and notify those that, but it’s up to you to determine who might be affected. whether the risks and costs of paying are worth the possibility of getting Contact the authorities your files back. However, paying the Report the attack right away ransom may not guarantee you get to your local FBI office. your data back. Notify customers If your data or personal information was compromised, make sure you notify the affected parties ― they could be at risk of identity theft. Find information on how to do that at Data Breach Response: A Guide for Business. You can find it at FTC.gov/DataBreach. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PHISHING You get an email that looks like it’s from someone you know. It seems to be from one of your company’s vendors and asks that you click on a link to update your business account. Should you click? Maybe it looks like it’s from your boss and asks for your network password. Should you reply? In either case, probably not. These may be phishing attempts. HOW YOU WHAT CAN DO PHISHING WORKS Before you click on a link or share any You get an email or text of your sensitive",
    "page_number": 8,
    "start_char": 0,
    "end_char": 2745,
    "word_count": 460,
    "metadata": {
      "original_page": 8,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 7,
      "next_page": 9,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_7",
    "next_page_ref": "page_9"
  },
  {
    "chunk_id": "8a11abf7",
    "text": "affected. whether the risks and costs of paying are worth the possibility of getting Contact the authorities your files back. However, paying the Report the attack right away ransom may not guarantee you get to your local FBI office. your data back. Notify customers If your data or personal information was compromised, make sure you notify the affected parties ― they could be at risk of identity theft. Find information on how to do that at Data Breach Response: A Guide for Business. You can find it at FTC.gov/DataBreach. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PHISHING You get an email that looks like it’s from someone you know. It seems to be from one of your company’s vendors and asks that you click on a link to update your business account. Should you click? Maybe it looks like it’s from your boss and asks for your network password. Should you reply? In either case, probably not. These may be phishing attempts. HOW YOU WHAT CAN DO PHISHING WORKS Before you click on a link or share any You get an email or text of your sensitive business information: It seems to be from someone you know, and it asks you to click a link, or give your Check it out password, business bank account, or other sensitive information. Look up the website or phone number for the company or person behind the text or It looks real email. Make sure that you’re getting the real company and not about to download It’s easy to spoof logos and make up fake email malware or talk to a scammer. addresses. Scammers use familiar company names or pretend to be someone you know. Talk to someone It’s urgent Talking to a colleague might help you figure The message pressures you to act now — out if the request is real or a phishing attempt. or something bad will happen. What happens next Make a call if you’re not sure If you click on a link, scammers can install Pick up the phone and call that vendor, ransomware or other programs that can colleague, or client who sent the email. lock you out of your data and spread to Confirm that they really need information the entire company network. If you share from you. Use a number you know to be passwords, scammers now have access to correct, not the number in the email or text. all those accounts. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS HOW TO WHAT IF YOU FALL FOR A PROTECT PHISHING SCHEME YOUR BUSINESS Back up your data Alert others Regularly back up your data and Talk to your colleagues and share your make sure those backups are not experience. Phishing attacks often happen to connected to the network. That more than one person in a company. way, if a phishing attack happens and hackers get to your network, Limit the damage you can restore your data. Make data backup part of your routine Immediately change any compromised business operations. passwords and disconnect from the network",
    "page_number": 9,
    "start_char": 0,
    "end_char": 2895,
    "word_count": 510,
    "metadata": {
      "original_page": 9,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 8,
      "next_page": 10,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_8",
    "next_page_ref": "page_10"
  },
  {
    "chunk_id": "b7165fbc",
    "text": "will happen. What happens next Make a call if you’re not sure If you click on a link, scammers can install Pick up the phone and call that vendor, ransomware or other programs that can colleague, or client who sent the email. lock you out of your data and spread to Confirm that they really need information the entire company network. If you share from you. Use a number you know to be passwords, scammers now have access to correct, not the number in the email or text. all those accounts. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS HOW TO WHAT IF YOU FALL FOR A PROTECT PHISHING SCHEME YOUR BUSINESS Back up your data Alert others Regularly back up your data and Talk to your colleagues and share your make sure those backups are not experience. Phishing attacks often happen to connected to the network. That more than one person in a company. way, if a phishing attack happens and hackers get to your network, Limit the damage you can restore your data. Make data backup part of your routine Immediately change any compromised business operations. passwords and disconnect from the network any computer or device that’s infected with malware. Keep your security up to date Follow your company’s procedures Always install the latest patches These may include notifying specific people and updates. Look for additional in your organization or contractors that help means of protection, like email you with IT. authentication and intrusion prevention software, and set them Notify customers to update automatically on your If your data or personal information was computers. On mobile devices, compromised, make sure you notify the you may have to do it manually. affected parties — they could be at risk of identity theft. Find information on how to do that Alert your staff at Data Breach Response: A Guide for Business (FTC.gov/DataBreach). Share with them this information. Keep in mind that phishing scammers change their tactics Report it often, so make sure you include Forward phishing emails to spam@uce. tips for spotting the latest phishing gov (an address used by the FTC) and to schemes in your regular training. reportphishing@apwg.org (an address used by the Anti-Phishing Working Group, which Deploy a safety net includes ISPs, security vendors, financial Use email authentication institutions, and law enforcement agencies). Let technology to help prevent the company or person that was impersonated phishing emails from reaching know about the phishing scheme. And report it your company’s inboxes in the to the FTC at FTC.gov/Complaint. first place. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS BUSINESS EMAIL IMPOSTERS A scammer sets up an email address Scammers do this to get passwords and that looks like it’s from your company. bank account numbers or to get someone to send them money. When this happens, Then the scammer sends out messages using your company has a lot to lose. Customers that email address. This practice is called and partners might lose trust and take their spoofing, and",
    "page_number": 10,
    "start_char": 0,
    "end_char": 3070,
    "word_count": 500,
    "metadata": {
      "original_page": 10,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 9,
      "next_page": 11,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_9",
    "next_page_ref": "page_11"
  },
  {
    "chunk_id": "b12f3eb6",
    "text": "it often, so make sure you include Forward phishing emails to spam@uce. tips for spotting the latest phishing gov (an address used by the FTC) and to schemes in your regular training. reportphishing@apwg.org (an address used by the Anti-Phishing Working Group, which Deploy a safety net includes ISPs, security vendors, financial Use email authentication institutions, and law enforcement agencies). Let technology to help prevent the company or person that was impersonated phishing emails from reaching know about the phishing scheme. And report it your company’s inboxes in the to the FTC at FTC.gov/Complaint. first place. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS BUSINESS EMAIL IMPOSTERS A scammer sets up an email address Scammers do this to get passwords and that looks like it’s from your company. bank account numbers or to get someone to send them money. When this happens, Then the scammer sends out messages using your company has a lot to lose. Customers that email address. This practice is called and partners might lose trust and take their spoofing, and the scammer is what we call a business elsewhere — and your business business email imposter. could then lose money. PROTECT HOW TO YOUR BUSINESS Use email authentication Keep your security Train your staff up to date When you set up your Teach them how to avoid business’s email, make sure Always install the latest patches phishing scams and show the email provider offers email and updates. Set them to them some of the common authentication technology. That update automatically on your ways attackers can infect way, when you send an email network. Look for additional computers and devices from your company’s server, the means of protection, like with malware. Include tips receiving servers can confirm intrusion prevention software, for spotting and protecting that the email is really from you. which checks your network for against cyber threats in your If it’s not, the receiving servers suspicious activity and sends regular employee trainings may block the email and foil a you alerts if it finds any. and communications. business email imposter. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS WHAT TO DO IF SOMEONE SPOOFS YOUR COMPANY’S EMAIL Report it Report the scam to local law enforcement, the FBI’s Internet Crime Complaint Center at IC3.gov, and the FTC at FTC.gov/ Complaint. You can also forward phishing emails to spam@ uce.gov (an address used by the FTC)",
    "page_number": 11,
    "start_char": 0,
    "end_char": 2504,
    "word_count": 399,
    "metadata": {
      "original_page": 11,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 10,
      "next_page": 12,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_10",
    "next_page_ref": "page_12"
  },
  {
    "chunk_id": "8b0549d3",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nWHAT TO DO\nIF SOMEONE SPOOFS YOUR COMPANY’S EMAIL\nReport it\nReport the scam to local law enforcement, the FBI’s Internet\nCrime Complaint Center at IC3.gov, and the FTC at FTC.gov/\nComplaint. You can also forward phishing emails to spam@\nuce.gov (an address used by the FTC) and to reportphishing@\napwg.org (an address used by the Anti-Phishing Working\nGroup, which includes ISPs, security vendors, financial\ninstitutions, and law enforcement agencies).\nNotify your customers\nIf you find out scammers are impersonating your business, tell\nyour customers as soon as possible — by mail, email, or social\nmedia. If you email your customers, send an email without\nhyperlinks. You don’t want your notification email to look like\na phishing scam. Remind customers not to share any personal\ninformation through email or text. If your customers’ data was\nstolen, direct them to IdentityTheft.gov to get a recovery plan.\nAlert your staff\nUse this experience to update your security practices and train\nyour staff about cyber threats.\nLEARN MORE AT:\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nTECH SUPPORT SCAMS\nYou get a phone call, pop-up, Often, scammers are behind these calls, pop-up\nmessages, and emails. They want to get your\nor email telling you there’s a\nmoney, personal information, or access to your\nproblem with your computer. files. This can harm your network, put your data\nat risk, and damage your business.\nSCAM WORKS\nHOW THE\nThe scammers may pretend to be from a well-known tech company, such as Microsoft. They use\nlots of technical terms to convince you that the problems with your computer are real. They may\nask you to open some files or run a scan on your computer — and then tell you those files or the\nscan results show a problem…but there isn’t one.\nThe scammers may then:\nAsk you to give them remote Try to enroll you in a worthless\naccess to your computer — which computer maintenance or\nlets them access all information warranty program\nstored on it, and on any network\nconnected to it Ask for credit card information\nso they can bill you for phony\nInstall malware that gives them services or services available\naccess to your computer and elsewhere for free\nsensitive data, like user names\nand passwords Direct you to websites and ask\nyou to enter credit card, bank\nTry to sell you software or repair account, and other personal\nservices that are worthless or information\navailable elsewhere for free\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 12,
    "start_char": 0,
    "end_char": 2500,
    "word_count": 414,
    "metadata": {
      "original_pages": [
        12,
        13
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_14"
  },
  {
    "chunk_id": "9b23970e",
    "text": "phishing scam. Remind customers not to share any personal information through email or text. If your customers’ data was stolen, direct them to IdentityTheft.gov to get a recovery plan. Alert your staff Use this experience to update your security practices and train your staff about cyber threats. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS TECH SUPPORT SCAMS You get a phone call, pop-up, Often, scammers are behind these calls, pop-up messages, and emails. They want to get your or email telling you there’s a money, personal information, or access to your problem with your computer. files. This can harm your network, put your data at risk, and damage your business. SCAM WORKS HOW THE The scammers may pretend to be from a well-known tech company, such as Microsoft. They use lots of technical terms to convince you that the problems with your computer are real. They may ask you to open some files or run a scan on your computer — and then tell you those files or the scan results show a problem…but there isn’t one. The scammers may then: Ask you to give them remote Try to enroll you in a worthless access to your computer — which computer maintenance or lets them access all information warranty program stored on it, and on any network connected to it Ask for credit card information so they can bill you for phony Install malware that gives them services or services available access to your computer and elsewhere for free sensitive data, like user names and passwords Direct you to websites and ask you to enter credit card, bank Try to sell you software or repair account, and other personal services that are worthless or information available elsewhere for free LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO YOUR BUSINESS If a caller says your computer has a problem, hang up. A tech support call you don’t expect is a scam — even if the number is local or looks legitimate. These scammers use fake caller ID information to look like local businesses or trusted companies. If you get a pop-up message to call tech support, ignore it. Some pop-up messages about computer issues are legitimate, but do not call a number or click on a link that appears in",
    "page_number": 13,
    "start_char": 0,
    "end_char": 2235,
    "word_count": 383,
    "metadata": {
      "original_page": 13,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 12,
      "next_page": 14,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_12",
    "next_page_ref": "page_14"
  },
  {
    "chunk_id": "02c780a3",
    "text": "for credit card information so they can bill you for phony Install malware that gives them services or services available access to your computer and elsewhere for free sensitive data, like user names and passwords Direct you to websites and ask you to enter credit card, bank Try to sell you software or repair account, and other personal services that are worthless or information available elsewhere for free LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO YOUR BUSINESS If a caller says your computer has a problem, hang up. A tech support call you don’t expect is a scam — even if the number is local or looks legitimate. These scammers use fake caller ID information to look like local businesses or trusted companies. If you get a pop-up message to call tech support, ignore it. Some pop-up messages about computer issues are legitimate, but do not call a number or click on a link that appears in a pop-up message warning you of a computer problem. If you’re worried about a virus or other threat, call your security software company directly, using the phone number on its website, the sales receipt, or the product packaging. Or consult a trusted security professional. Never give someone your password, and don’t give remote access to your computer to someone who contacts you unexpectedly. WHAT TO DO IF YOU’RE SCAMMED If you shared your password with If the affected computer is a scammer, change it on every connected to your network, you or a account that uses this password. security professional should check Remember to use unique passwords the entire network for intrusions. for each account and service. If you bought bogus services, Consider using a password manager. ask your credit card company to Get rid of malware. Update or reverse the charges, and check download legitimate security your statement for any charges software. Scan your computer, and you didn’t approve. Keep checking delete anything the software says is your credit card statements to make a problem. If you need help, consult sure the scammer doesn’t try to a trusted security professional. re-charge you every month. Report the attack right away to the FTC at FTC.gov/Complaint. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS CYBER INSURANCE Recovering from Cyber insurance is one option that can help protect your business against losses resulting from a cyber attack. If you’re thinking a cyber attack about cyber insurance, discuss with your insurance agent what policy would best fit your company’s needs, including whether can be costly. you should go with first-party",
    "page_number": 14,
    "start_char": 0,
    "end_char": 2628,
    "word_count": 428,
    "metadata": {
      "original_page": 14,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 13,
      "next_page": 15,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_13",
    "next_page_ref": "page_15"
  },
  {
    "chunk_id": "0da597e6",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nCYBER INSURANCE\nRecovering from\nCyber insurance is one option that can help protect your business\nagainst losses resulting from a cyber attack. If you’re thinking\na cyber attack about cyber insurance, discuss with your insurance agent what\npolicy would best fit your company’s needs, including whether\ncan be costly. you should go with first-party coverage, third-party coverage, or\nboth. Here are some general tips to consider.\nWHAT SHOULD YOUR\nCYBER INSURANCE POLICY\nCOVER?\nMake sure your policy includes coverage for:\nData breaches (like incidents Cyber attacks on your data Terrorist acts\ninvolving theft of personal held by vendors and other\ninformation) third parties\nCyber attacks (like breaches Cyber attacks that occur\nof your network) anywhere in the world (not\nonly in the United States)\nAlso, consider whether your cyber insurance provider will:\nDefend you in a lawsuit or Provide coverage in excess Offer a breach hotline\nregulatory investigation (look of any other applicable that’s available every day\nfor “duty to defend” wording) insurance you have of the year at all times\nLEARN MORE AT:\nThe FTC thanks the National Association of Insurance\nFTC.gov/SmallBusiness Commissioners (NAIC) for its role in developing this content.\nCYBERSECURITY FOR\nSMALL BUSINESS\nWHAT IS\nFIRST-PARTY COVERAGE\nAND WHAT SHOULD YOU LOOK FOR?\nFirst-party cyber coverage protects your data, including employee and customer\ninformation. This coverage typically includes your business’s costs related to:\nLegal counsel to Customer notification Crisis management Forensic services\ndetermine your and call center and public relations to investigate the\nnotification and services breach\nregulatory obligations\nRecovery and Lost income Cyber extortion Fees, fines, and\nreplacement of lost due to business and fraud penalties related to\nor stolen data interruption the cyber incident\nWHAT IS\nTHIRD-PARTY COVERAGE\nAND WHAT SHOULD YOU LOOK FOR?\nThird-party cyber coverage generally protects you from liability if a third party\nbrings claims against you. This coverage typically includes:\nPayments to consumers Claims and settlement Losses related to\naffected by the breach expenses relating to defamation and copyright\ndisputes or lawsuits or trademark infringement\nCosts for litigation and Other settlements, Accounting costs\nresponding to regulatory damages, and judgments\ninquiries\nMore insurance resources for small businesses available at www.insureuonline.org/smallbusiness\nLEARN MORE AT:\nThe FTC thanks the National Association of Insurance\nFTC.gov/SmallBusiness Commissioners (NAIC) for its role in developing this content.",
    "page_number": 15,
    "start_char": 0,
    "end_char": 2646,
    "word_count": 383,
    "metadata": {
      "original_pages": [
        15,
        16
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_17"
  },
  {
    "chunk_id": "de69e3d0",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nWHAT IS\nFIRST-PARTY COVERAGE\nAND WHAT SHOULD YOU LOOK FOR?\nFirst-party cyber coverage protects your data, including employee and customer\ninformation. This coverage typically includes your business’s costs related to:\nLegal counsel to Customer notification Crisis management Forensic services\ndetermine your and call center and public relations to investigate the\nnotification and services breach\nregulatory obligations\nRecovery and Lost income Cyber extortion Fees, fines, and\nreplacement of lost due to business and fraud penalties related to\nor stolen data interruption the cyber incident\nWHAT IS\nTHIRD-PARTY COVERAGE\nAND WHAT SHOULD YOU LOOK FOR?\nThird-party cyber coverage generally protects you from liability if a third party\nbrings claims against you. This coverage typically includes:\nPayments to consumers Claims and settlement Losses related to\naffected by the breach expenses relating to defamation and copyright\ndisputes or lawsuits or trademark infringement\nCosts for litigation and Other settlements, Accounting costs\nresponding to regulatory damages, and judgments\ninquiries\nMore insurance resources for small businesses available at www.insureuonline.org/smallbusiness\nLEARN MORE AT:\nThe FTC thanks the National Association of Insurance\nFTC.gov/SmallBusiness Commissioners (NAIC) for its role in developing this content.\nCYBERSECURITY FOR\nSMALL BUSINESS\nEMAIL AUTHENTICATION\nEmail authentication technology makes it a lot harder for a scammer to\nsend phishing emails that look like they’re from your company.\nUsing email authentication technology makes it a lot harder for scammers to send phishing emails.\nThis technology allows a receiving server to verify an email from your company and block emails\nfrom an imposter — or send them to a quarantine folder and then notify you about them.\nKNOW\nWHAT TO\nSome web host providers let you set up your company’s business email using your domain name (which\nyou may think of as your website name). Your domain name might look like this: yourbusiness.com. And\nyour email may look like this: name@yourbusiness.com. Without email authentication, scammers can use\nthat domain name to send emails that look like they’re from your business. If your business email uses your\ncompany’s domain name, make sure that your email provider has these three email authentication tools:\nSender Policy Framework (SPF) Domain-based Message Authentication,\nReporting & Conformance (DMARC)\ntells other servers which servers are allowed to\nsend emails using your business’s domain name. So\nis the essential third tool for email\nwhen you send an email from name@yourbusiness.\nauthentication. SPF and DKIM verify the address\ncom, the receiving server can confirm that the\nthe server uses “behind the scenes.” DMARC\nsending server is on an approved list. If it is, the\nverifies that this address matches the “from”\nreceiving server lets the email through. If it can’t find\naddress you see. It also lets you tell other\na match, the email can be flagged as suspicious.\nservers what to do when they get an email that\nlooks like it came from your domain, but the\nDomain Keys Identified Mail (DKIM)\nreceiving server has reason to be suspicious\nputs a digital signature on outgoing mail so servers (based on SPF or DKIM). You can have other\ncan verify that an email from your domain actually servers reject the email, flag it as spam, or take\nwas sent from your organization’s servers and hasn’t no action. You also can set up DMARC so that\nbeen tampered with in transit. you’re notified when this happens.\nIt takes some expertise to configure these tools so that they work as intended and don’t block legitimate\nemail. Make sure that your email hosting provider can set them up if you don’t have the technical\nknowledge. If they can’t, or don’t include that in their service agreement, consider getting another provider.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 16,
    "start_char": 0,
    "end_char": 3921,
    "word_count": 608,
    "metadata": {
      "original_pages": [
        16,
        17
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_18"
  },
  {
    "chunk_id": "f6e79c31",
    "text": "relating to defamation and copyright disputes or lawsuits or trademark infringement Costs for litigation and Other settlements, Accounting costs responding to regulatory damages, and judgments inquiries More insurance resources for small businesses available at www.insureuonline.org/smallbusiness LEARN MORE AT: The FTC thanks the National Association of Insurance FTC.gov/SmallBusiness Commissioners (NAIC) for its role in developing this content. CYBERSECURITY FOR SMALL BUSINESS EMAIL AUTHENTICATION Email authentication technology makes it a lot harder for a scammer to send phishing emails that look like they’re from your company. Using email authentication technology makes it a lot harder for scammers to send phishing emails. This technology allows a receiving server to verify an email from your company and block emails from an imposter — or send them to a quarantine folder and then notify you about them. KNOW WHAT TO Some web host providers let you set up your company’s business email using your domain name (which you may think of as your website name). Your domain name might look like this: yourbusiness.com. And your email may look like this: name@yourbusiness.com. Without email authentication, scammers can use that domain name to send emails that look like they’re from your business. If your business email uses your company’s domain name, make sure that your email provider has these three email authentication tools: Sender Policy Framework (SPF) Domain-based Message Authentication, Reporting & Conformance (DMARC) tells other servers which servers are allowed to send emails using your business’s domain name. So is the essential third tool for email when you send an email from name@yourbusiness. authentication. SPF and DKIM verify the address com, the receiving server can confirm that the the server uses “behind the scenes.” DMARC sending server is on an approved list. If it is, the verifies that this address matches the “from” receiving server lets the email through. If it can’t find address you see. It also lets you tell other a match, the email can be flagged as suspicious. servers what to do when they get an email that looks like it came from your domain, but the Domain Keys Identified Mail (DKIM) receiving server has reason to be suspicious puts a digital signature on outgoing mail so servers (based on SPF or DKIM). You can have other can verify that an email from your domain actually servers reject the email, flag it as spam, or take was sent from your organization’s servers and hasn’t no action. You also can set up DMARC so that been tampered with in transit. you’re notified when this happens. It takes some expertise to configure these tools so that they work as intended and don’t block legitimate email. Make sure that your email hosting provider can set them up if you don’t have the technical knowledge. If they can’t, or don’t include that in their service agreement, consider getting another provider. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS WHAT TO DO IF YOUR EMAIL IS SPOOFED Email authentication helps keep your business’s email from being used in phishing schemes because it notifies you if someone spoofs your company’s email. If you get that notification, take these actions: Report it Report the scam to local law enforcement, the FBI’s Internet Crime Complaint Center at",
    "page_number": 17,
    "start_char": 0,
    "end_char": 3370,
    "word_count": 536,
    "metadata": {
      "original_page": 17,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 16,
      "next_page": 18,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_16",
    "next_page_ref": "page_18"
  },
  {
    "chunk_id": "cbf9711c",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nWHAT TO DO IF YOUR\nEMAIL IS SPOOFED\nEmail authentication helps keep your business’s email from being used in phishing schemes\nbecause it notifies you if someone spoofs your company’s email. If you get that notification,\ntake these actions:\nReport it\nReport the scam to local law enforcement, the FBI’s Internet Crime\nComplaint Center at IC3.gov, and the FTC at FTC.gov/Complaint. You\nalso can forward phishing emails to spam@uce.gov (an address used by\nthe FTC) and to reportphishing@apwg.org (an address used by the\nAnti-Phishing Working Group, which includes ISPs, security vendors,\nfinancial institutions, and law enforcement agencies).\nNotify your customers\nIf you find out scammers are impersonating your business, tell your\ncustomers as soon as possible — by mail, email, or social media. If you\nemail your customers, send an email without hyperlinks: you don’t want\nyour notification email to look like a phishing scam. Remind customers\nnot to share any personal information through email or text. And if your\ncustomers’ data was stolen, direct them to IdentityTheft.gov to get a\nrecovery plan.\nAlert your staff\nUse this experience to update your security practices and train your staff\nabout cyber threats.\nLEARN MORE AT:\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nVENDOR SECURIT Y\nYour business vendors Make sure those vendors are securing their own computers\nand networks. For example, what if your accountant, who\nmay have access to\nhas all your financial data, loses his laptop? Or a vendor\nwhose network is connected to yours gets hacked? The\nsensitive information.\nresult: your business data and your customers’ personal\ninformation may end up in the wrong hands — putting your\nbusiness and your customers at risk.\nMONITOR\nHOW TO YOUR VENDORS\nPut it in writing Verify compliance Make changes as needed\nInclude provisions for security Establish processes so you Cybersecurity threats\nin your vendor contracts, like can confirm that vendors change rapidly. Make sure\na plan to evaluate and update follow your rules. Don’t just your vendors keep their\nsecurity controls, since threats take their word for it. security up to date.\nchange. Make the security\nprovisions that are critical to\nyour company non-negotiable.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 18,
    "start_char": 0,
    "end_char": 2309,
    "word_count": 360,
    "metadata": {
      "original_pages": [
        18,
        19
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_20"
  },
  {
    "chunk_id": "08b5b725",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nVENDOR SECURIT Y\nYour business vendors Make sure those vendors are securing their own computers\nand networks. For example, what if your accountant, who\nmay have access to\nhas all your financial data, loses his laptop? Or a vendor\nwhose network is connected to yours gets hacked? The\nsensitive information.\nresult: your business data and your customers’ personal\ninformation may end up in the wrong hands — putting your\nbusiness and your customers at risk.\nMONITOR\nHOW TO YOUR VENDORS\nPut it in writing Verify compliance Make changes as needed\nInclude provisions for security Establish processes so you Cybersecurity threats\nin your vendor contracts, like can confirm that vendors change rapidly. Make sure\na plan to evaluate and update follow your rules. Don’t just your vendors keep their\nsecurity controls, since threats take their word for it. security up to date.\nchange. Make the security\nprovisions that are critical to\nyour company non-negotiable.\nLEARN MORE AT:\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nPROTECT\nHOW TO YOUR BUSINESS\nControl access\nPut controls on databases with sensitive information. Limit access to a need-to-know\nbasis, and only for the amount of time a vendor needs to do a job.\nUse multi-factor authentication\nThis makes vendors take additional steps beyond logging in with a password to\naccess your network — like a temporary code on a smartphone or a key that’s\ninserted into a computer.\nSecure your network\nRequire strong passwords: at least 12 characters with a mix of numbers, symbols, and\nboth capital and lowercase letters. Never reuse passwords, don’t share them, and\nlimit the number of unsuccessful log-in attempts to limit password-guessing attacks.\nSafeguard your data\nUse properly configured, strong encryption. This protects sensitive information as\nit’s transferred and stored.\nWHAT TO DO IF A Contact the authorities Confirm the vendor\nVENDOR HAS A has a fix\nReport the attack right\nDATA BREACH away to your local police\nMake sure that the vendor\ndepartment. If they’re not\nfixes the vulnerabilities and\nfamiliar with investigating\nensures that your information\ninformation compromises,\nwill be safe going forward,\ncontact your local FBI office.\nif your business decides to\ncontinue using the vendor.\nNotify customers\nIf your data or personal information was compromised,\nmake sure you notify the affected parties — they could be\nat risk of identity theft. Find information on how to do that\nat Data Breach Response: A Guide for Business. Find it at\nFTC.gov/DataBreach.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 19,
    "start_char": 0,
    "end_char": 2598,
    "word_count": 409,
    "metadata": {
      "original_pages": [
        19,
        20
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": "page_21"
  },
  {
    "chunk_id": "576ca961",
    "text": "change rapidly. Make sure a plan to evaluate and update follow your rules. Don’t just your vendors keep their security controls, since threats take their word for it. security up to date. change. Make the security provisions that are critical to your company non-negotiable. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS PROTECT HOW TO YOUR BUSINESS Control access Put controls on databases with sensitive information. Limit access to a need-to-know basis, and only for the amount of time a vendor needs to do a job. Use multi-factor authentication This makes vendors take additional steps beyond logging in with a password to access your network — like a temporary code on a smartphone or a key that’s inserted into a computer. Secure your network Require strong passwords: at least 12 characters with a mix of numbers, symbols, and both capital and lowercase letters. Never reuse passwords, don’t share them, and limit the number of unsuccessful log-in attempts to limit password-guessing attacks. Safeguard your data Use properly configured, strong encryption. This protects sensitive information as it’s transferred and stored. WHAT TO DO IF A Contact the authorities Confirm the vendor VENDOR HAS A has a fix Report the attack right DATA BREACH away to your local police Make sure that the vendor department. If they’re not fixes the vulnerabilities and familiar with investigating ensures that your information information compromises, will be safe going forward, contact your local FBI office. if your business decides to continue using the vendor. Notify customers If your data or personal information was compromised, make sure you notify the affected parties — they could be at risk of identity theft. Find information on how to do that at Data Breach Response: A Guide for Business. Find it at FTC.gov/DataBreach. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS HIRING A WEB HOST You may want a new But if you don’t have the skills to set up the web presence you want, you may want to hire a web host or upgraded website provider to do it for you. Whether you’re upgrading a website or launching a new business, there are many for your business. web-hosting options. When comparing services, security should be a top concern. LOOK FOR WHAT TO Transport Layer Security (TLS) Email authentication The service you choose should",
    "page_number": 20,
    "start_char": 0,
    "end_char": 2381,
    "word_count": 383,
    "metadata": {
      "original_page": 20,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 19,
      "next_page": 21,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_19",
    "next_page_ref": "page_21"
  },
  {
    "chunk_id": "e96e2e9b",
    "text": "ensures that your information information compromises, will be safe going forward, contact your local FBI office. if your business decides to continue using the vendor. Notify customers If your data or personal information was compromised, make sure you notify the affected parties — they could be at risk of identity theft. Find information on how to do that at Data Breach Response: A Guide for Business. Find it at FTC.gov/DataBreach. LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS HIRING A WEB HOST You may want a new But if you don’t have the skills to set up the web presence you want, you may want to hire a web host or upgraded website provider to do it for you. Whether you’re upgrading a website or launching a new business, there are many for your business. web-hosting options. When comparing services, security should be a top concern. LOOK FOR WHAT TO Transport Layer Security (TLS) Email authentication The service you choose should include TLS, Some web host providers let you set up your which will help to protect your customers’ company’s business email using your domain privacy. (You may have heard of its name (that’s part of your URL, and what you may predecessor, Secure Sockets Layer, or SSL.) think of as your website name). Your domain name TLS helps make sure that your customers get might look like this: yourbusiness.com. And your to your real website when they type your URL email may look like this: name@yourbusiness.com. into the address bar. When TLS is correctly If you don’t have email authentication, scammers implemented on your website, your URL will can impersonate that domain name and send begin with https://. emails that look like they’re from your business. TLS also helps make sure the information When your business email is set up using sent to your website is encrypted. That’s your company’s domain name, make sure that especially important if you ask customers your web host can give you these three email for sensitive information, like credit card authentication tools: numbers or passwords. • Sender Policy Framework (SPF) • Domain Keys Identified Mail (DKIM) • Domain-based Message Authentication, Reporting & Conformance (DMARC) LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS WHAT TO Software updates LOOK FOR Many web host providers offer pre-built websites or software packages designed to make it quick and easy to set up your company’s website. As with any software, it is essential that you use the latest versions with up-to-date security patches. Make sure you know how to keep the website’s software up to date, or whether the web host provider will do this for you. Website management If a web host provider is managing your website, you may have to go through that",
    "page_number": 21,
    "start_char": 0,
    "end_char": 2777,
    "word_count": 457,
    "metadata": {
      "original_page": 21,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 20,
      "next_page": 22,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_20",
    "next_page_ref": "page_22"
  },
  {
    "chunk_id": "c22c44f8",
    "text": "https://. emails that look like they’re from your business. TLS also helps make sure the information When your business email is set up using sent to your website is encrypted. That’s your company’s domain name, make sure that especially important if you ask customers your web host can give you these three email for sensitive information, like credit card authentication tools: numbers or passwords. • Sender Policy Framework (SPF) • Domain Keys Identified Mail (DKIM) • Domain-based Message Authentication, Reporting & Conformance (DMARC) LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS WHAT TO Software updates LOOK FOR Many web host providers offer pre-built websites or software packages designed to make it quick and easy to set up your company’s website. As with any software, it is essential that you use the latest versions with up-to-date security patches. Make sure you know how to keep the website’s software up to date, or whether the web host provider will do this for you. Website management If a web host provider is managing your website, you may have to go through that provider to make any changes — though you may be able to log in and make some changes yourself. Some web host providers may instead offer you the option of managing the website on your own. It’s important to clarify from the beginning who will manage the website after it’s built. ASK WHAT TO When you’re hiring a web host provider, ask these questions to make sure you’re helping protect your customer information and your business data. Is TLS included in the hosting plan? Are the most up-to-date software paid add-on? Will I set it up myself or versions available with your service, and will you help me set it up? will you keep software updated? If it’s my responsibility to keep software updated, is it easy for me to do? Can my business email use my After the website is set up, who will be business website name? If so, can able to make changes to it? Will I have to you help me set up SPF, DKIM, go through you? Will I be able to log in and DMARC email authentication and make changes on my own? If I can technology? (If not, consider looking log in to make changes, is multi-factor for a provider that does.) authentication available? LEARN MORE AT: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS SECURE REMOTE ACCESS Employees and vendors may need to connect to your network remotely. Put your network’s security first. Make employees and vendors follow strong security standards before they connect to your network. Give them the tools to make security part of their work routine. HOW TO PROTECT DEVICES Whether employees or vendors use company-issued",
    "page_number": 22,
    "start_char": 0,
    "end_char": 2682,
    "word_count": 453,
    "metadata": {
      "original_page": 22,
      "has_prev_overlap": true,
      "has_next_overlap": true,
      "prev_page": 21,
      "next_page": 23,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_21",
    "next_page_ref": "page_23"
  },
  {
    "chunk_id": "bf306988",
    "text": "CYBERSECURITY FOR\nSMALL BUSINESS\nSECURE\nREMOTE ACCESS\nEmployees and vendors may need to connect to your network remotely.\nPut your network’s security first. Make employees and vendors follow strong security standards before\nthey connect to your network. Give them the tools to make security part of their work routine.\nHOW TO\nPROTECT DEVICES\nWhether employees or vendors use company-issued devices or their own when\nconnecting remotely to your network, those devices should be secure. Follow these\ntips — and make sure your employees and vendors do as well:\nAlways change any pre-set router passwords and the\ndefault name of your router. And keep the router’s\nsoftware up to date; you may have to visit the router’s\nwebsite often to do so.\nConsider enabling full-disk encryption for laptops and\nother mobile devices that connect remotely to your\nnetwork. Check your operating system for this option,\nwhich will protect any data stored on the device if it’s\nlost or stolen. This is especially important if the device\nstores any sensitive personal information.\nChange smartphone settings to stop automatic\nconnections to public Wi-Fi.\nKeep up-to-date antivirus software on devices that\nconnect to your network, including mobile devices.\nLLEEAARRNN MMOORREE AATT::\nFTC.gov/SmallBusiness\nCYBERSECURITY FOR\nSMALL BUSINESS\nHOW TO CONNECT\nRequire employees and vendors to use secure\nREMOTELY\nconnections when connecting remotely to your\nTO THE NETWORK network. They should:\nUse a router with WPA2 or WPA3 encryption when connecting from their homes.\nEncryption protects information sent over a network so that outsiders can’t read it.\nWPA2 and WPA3 are the only encryption standards that will protect information sent\nover a wireless network.\nOnly use public Wi-Fi when also using a virtual private network (VPN) to encrypt\ntraffic between their computers and the internet. Public Wi-Fi does not provide a\nsecure internet connection on its own. Your employees can get a personal VPN\naccount from a VPN service provider, or you may want to hire a vendor to create an\nenterprise VPN for all employees to use.\nMAINTAIN SECURITY\nWHAT TO DO TO\nTrain your staff: Include information on secure remote access in regular trainings and new\nstaff orientations.\nHave policies covering basic cybersecurity, give copies to your employees,\nand explain the importance of following them.\nBefore letting any device — whether at an employee’s home or on a vendor’s\nnetwork — connect to your network, make sure it meets your network’s\nsecurity requirements.\nTell your staff about the risks of public Wi-Fi.\nGive your staff tools that will help maintain security:\n• Require employees to use • Require multi-factor authentication to access areas of your\nunique, complex network network that have sensitive information. This requires additional\npasswords and avoid steps beyond logging in with a password — like a temporary\nunattended, open workstations. code on a smartphone or a key that’s inserted into a computer.\n• Consider creating a VPN • If you offer Wi-Fi on your • Include provisions for\nfor employees to use when business premises for guests security in your vendor\nconnecting remotely to the and customers, make sure it’s contracts, especially if the\nbusiness network. separate from and not connected vendor will be connecting\nto your business network. remotely to your network.\nLEARN MORE AT:\nFTC.gov/SmallBusiness",
    "page_number": 23,
    "start_char": 0,
    "end_char": 3397,
    "word_count": 536,
    "metadata": {
      "original_pages": [
        23,
        24
      ],
      "chunk_type": "combined_pages",
      "combined_reason": "small_page"
    },
    "previous_page_ref": "",
    "next_page_ref": ""
  },
  {
    "chunk_id": "3cf7cad7",
    "text": "operating system for this option, which will protect any data stored on the device if it’s lost or stolen. This is especially important if the device stores any sensitive personal information. Change smartphone settings to stop automatic connections to public Wi-Fi. Keep up-to-date antivirus software on devices that connect to your network, including mobile devices. LLEEAARRNN MMOORREE AATT:: FTC.gov/SmallBusiness CYBERSECURITY FOR SMALL BUSINESS HOW TO CONNECT Require employees and vendors to use secure REMOTELY connections when connecting remotely to your TO THE NETWORK network. They should: Use a router with WPA2 or WPA3 encryption when connecting from their homes. Encryption protects information sent over a network so that outsiders can’t read it. WPA2 and WPA3 are the only encryption standards that will protect information sent over a wireless network. Only use public Wi-Fi when also using a virtual private network (VPN) to encrypt traffic between their computers and the internet. Public Wi-Fi does not provide a secure internet connection on its own. Your employees can get a personal VPN account from a VPN service provider, or you may want to hire a vendor to create an enterprise VPN for all employees to use. MAINTAIN SECURITY WHAT TO DO TO Train your staff: Include information on secure remote access in regular trainings and new staff orientations. Have policies covering basic cybersecurity, give copies to your employees, and explain the importance of following them. Before letting any device — whether at an employee’s home or on a vendor’s network — connect to your network, make sure it meets your network’s security requirements. Tell your staff about the risks of public Wi-Fi. Give your staff tools that will help maintain security: • Require employees to use • Require multi-factor authentication to access areas of your unique, complex network network that have sensitive information. This requires additional passwords and avoid steps beyond logging in with a password — like a temporary unattended, open workstations. code on a smartphone or a key that’s inserted into a computer. • Consider creating a VPN • If you offer Wi-Fi on your • Include provisions for for employees to use when business premises for guests security in your vendor connecting remotely to the and customers, make sure it’s contracts, especially if the business network. separate from and not connected vendor will be connecting to your business network. remotely to your network. LEARN MORE AT: FTC.gov/SmallBusiness",
    "page_number": 24,
    "start_char": 0,
    "end_char": 2531,
    "word_count": 397,
    "metadata": {
      "original_page": 24,
      "has_prev_overlap": true,
      "has_next_overlap": false,
      "prev_page": 23,
      "next_page": null,
      "overlap_ratio": 0.3,
      "chunk_type": "page_with_overlap"
    },
    "previous_page_ref": "page_23",
    "next_page_ref": ""
  }
]